<?php

return [
    'fields' => [
        'first_name' => 'الاسم  الأول',
        'last_name' => 'الاسم الأخير',
        'email' => 'البريد الإلكتروني',
        'role' => 'الأدوار',
        'permissions' => 'الصلاحيات',
        'name' => 'الاسم',
        'full_name' => 'الاسم الكامل',
        'description' => 'الوصف',
        'id' => 'الرقم التعريفي',
        'created_at' => 'تاريخ الانشاء',
        'password' => 'كلمة المرور',
        'password_confirm' => 'تأكيد كلمة المرور',
        'active' => 'نشط',
        'expires_at' => 'تاريخ الانتهاء',
        'code' => 'رمز التحقق',
    ],
    'resources' => [
        'admin_user' => 'مستخدم مدير',
        'admin_users' => 'المستخدمون المسؤولون',
        'role' => 'دور',
        'roles' => 'أدوار',
        'permission' => 'صلاحية',
        'permissions' => 'صلاحيات',
        'group' => 'الإدارة',
    ],
    'sections' => [
        'permissions' => 'الصلاحيات',
        'user_details' => 'تفاصيل المستخدم',
    ],
    'messages' => [
        'permissions_create' => 'قد يكون للمستخدمين أذونات أخرى من دورهم. يتم سرد الأذونات الفعلية في صفحة العرض.',
        'permissions_view' => 'أذونات مباشرة وكذلك أذونات من خلال دورهم.',
        'account_expired' => 'هذا الحساب منتهي الصلاحية. الرجاء الاتصال بالمسؤول.',
        'accounts_extended' => 'تم تمديد الحسابات المختارة.',
        'invalid_user' => 'مستخدم غير صالح ، يرجى المحاولة مرة أخرى.',
        'code_expired' => 'انتهت صلاحية رمز التحقق هذا. الرجاء استخدام الرمز الجديد الذي أرسلناه لك للتو.',
        'invalid_code' => 'رمز التحقق غير صالح.',
        'enter_code' => 'لتأكيد تسجيل الدخول الخاص بك ، يرجى إدخال رمز التحقق المرسل إلى عنوان بريدك الإلكتروني.',
    ],
    'pages' => [
        'reset_password' => 'استعادة كلمة المرور',
        'account_expired' => 'الحساب منتهي',
        'two_factor' => 'التحقق بخطوتين',
    ],
    'notifications' => [
        'salutation' => 'تحياتي',
        'password_reset' => [
            'title' => 'كلمة مرور المسؤول الخاصة بـ :host',
            'message' => 'أنت تتلقى هذا البريد الإلكتروني لأننا تلقينا طلب إعادة تعيين كلمة المرور لحسابك.',
            'button' => 'إعادة تعيين كلمة المرور',
            'expiry' => 'ستنتهي صلاحية رابط إعادة تعيين كلمة المرور في :count الدقائق. إذا لم تطلب إعادة تعيين كلمة المرور ، فلا داعي لاتخاذ أي إجراء آخر.',
        ],
        'password_set' => [
            'title' => 'حسابك كمسؤول خاصة بـ :host',
            'message' => 'أنت تتلقى هذا البريد الإلكتروني لأنه تم مؤخرًا إنشاء حساب مسؤول من أجلك لـ :host المضيف. الرجاء الضغط على الرابط التالي لتعيين كلمة المرور الخاصة بك:',
            'button' => 'ضبط كلمة المرور',
            'expiry' => 'ستنتهي صلاحية رابط تعيين كلمة المرور هذا في :count الدقائق. في حالة انتهاء صلاحية الرابط ، يمكنك محاولة [إعادة تعيين كلمة المرور يدويًا] (:url).',
        ],
        'two_factor' => [
            'title' => 'رمز التحقق كمسؤول خاصة بـ :host',
            'message' => 'لتأكيد تسجيل الدخول الخاص بك ، يرجى استخدام رمز التحقق التالي. الكود صالح لمدة 5 دقائق.',
        ],
    ],
    'buttons' => [
        'back_to_login' => 'العودة إلى تسجيل الدخول',
        'forgot_password' => 'هل نسيت كلمة المرور؟',
        'submit' => 'حفظ',
    ],
    'filters' => [
        'expired' => 'منتهي الصلاحية',
    ],
    'actions' => [
        'extend' => 'تمديد تاريخ انتهاء الصلاحية',
    ],
];
